[{"what_to_know": ["Plug-in version of Prius hybrid", "Unique front and rear styling", "Up to 25 miles of all-electric range", "Recharges in less than 5.5 hours on a household outlet", "11.6-inch dashboard touchscreen available"], "maker": "Toyota", "model": "prius-prime", "production_year": "2017", "type": "Hatchback", "price": "$17,252 — $27,160\n                        USED", "pros": ["More conventional styling than regular Prius", "Driving range of more than 600 miles", "Many active safety features standard", "Not much more expensive than regular Prius"], "cons": ["Apple CarPlay, Android Auto connectivity not offered", "Remote-controlled climate system only in top trim level"], "expert": "", "consumers": [{"name": "Dalcon95\n", "title": "Excellent Car!!!", "date": "Apr 12 2017", "consumers_reviews": "I love this car and would highly recommend anyone to buy this car! I get 64mpg on only gas. I get 35 miles of electric range. I have driven 4200 miles and only filled up once with 460 miles left on the second tank! I love the advanced trim with the Entune app where you can set your temperature ahead of time before you get to the car, you can manage and monitor your charging status, and compare other Prime Advance drivers to see who is the most efficient. It is a highly efficient and technological!", "Howhelpful": {"Yes": 24, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "jaxplace8425\n", "title": "2017 Prius Prime", "date": "Apr 05 2017", "consumers_reviews": "I love this car.  It gives me 26 miles on an electric charge.  I can do all my local stuff and I don't run out of charge.  I wish it had more electrical miles but it really is great.  It has built in safety features and the cruise control is great.  There is nothing more irritating when you are in traffic and everybody slows down the radar on the cruise maintains distance between the car in front and reduces the speed.  IT'S GREAT!  Automatically stops car when someone in front stops.", "Howhelpful": {"Yes": 14, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "spconsult\n", "title": "Great upgrade from 2012", "date": "Jul 14 2017", "consumers_reviews": "This is a terrific car.  I love the plug in capability and the extra miles you get on electric. The car rides well; it has plenty of pep and an extra power button when you need it (like entering a freeway or climbing hills).  It is very comfortable with the adjustable seats.\nthe only drawback is that Toyota engineers over-engineer the dashboard and make it very complicated, when it should be simplified.  for example, I cannot switch to bluetooth (or USB) when I am listening to a radio station without going through multiple steps - a no-no when driving.", "Howhelpful": {"Yes": 11, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 4.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "PriusPrime\n", "title": "So Much Fun To Drive.", "date": "Apr 17 2017", "consumers_reviews": "I've had my Prius Prime for just under one month -- have driven close to 1000 miles, and haven't had to put any gas in it yet (left dealership with a full tank).  I love the responsiveness and handling, and I'm slowly learning to utilize all the amazing tech features.    I am continually stopped by strangers in parking lots who ask about the car, both for the great style and the plug-in hybrid feature.   It's a great car!", "Howhelpful": {"Yes": 10, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "car", "title": "Best car I've owned", "date": "May 23 2017", "consumers_reviews": "I got the highest advanced trim level and I am happy I did as it has terrific extra features.  I live 36 miles from work and it gets there on a single charge, so essentially no gas to get to work.  As its uphill coming back I need about 4 miles on gas to make it home.  Touch screen and jbl audio are fantastic. Seats are very comfortable.  Even the back two seats are really comfortable. Much better than three seater in older model.  I've now driven 7000 miles in this car and I can say its the best car I've ever owned or leased.", "Howhelpful": {"Yes": 9, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "mbailes\n", "title": "LOVE CAR", "date": "Mar 10 2017", "consumers_reviews": "Love the way the car rides, handles.    The only problem is the car is very new and nobody even the dealer knows how to program the climate control from your mobile phone.  (so you an start the car to either cool/warm it outside.    If anyone knows how to do solve the problem please advise.", "Howhelpful": {"Yes": 9, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Does recommend this car!!"]}, {"name": "James\n", "title": "Prius prime test drive.", "date": "Aug 04 2017", "consumers_reviews": "I currently own a 2009 Prius (which is the most reliable car I've ever owned) and as somone looking to get a new car the new Prius prime has more than peaked my interest. Mostly everything about the car is great! It's definitely a lot more fun to drive than previous Prius models and it also comes with a lot more bells and whistles. However it has a few flaws. As a Prius owner already I expect to have 5 seats not 4. I also expect to have the same amount of cargo space as I already have and not less. It would also be nice to pair apple or android car systems with such an awesomely large screen as the prime has similar to the screen newer Volvos have. All and all I'm waiting to see what a future Prius prime may have to offer, but who knows how long that may take. If only there was a Prius with awd, 5 seats, cargo space, a media platform that paired well with your cell phone, along with air suspension, and 55+ mpgs with an awesome battery to charge. Toyota would probably have the best selling car in America if not the world.  Until that's all a reality prime really is a great option despite its pitfalls, especially with the savings from tax credits. It should be a serious consideration if you want a new Prius that feels more premium, and gets insanely great mileage, paired with the Prius brands already infamous reliability.", "Howhelpful": {"Yes": 8, "No": 0}, "evaluation": {"Comfort": 4.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 0.0, "Performance": 4.0, "Exterior Styling": 4.0, "overall": 4.0}, "context": ["Does recommend this car!!"]}, {"name": "LarryS\n", "title": "Feel really safe in it", "date": "Jun 25 2017", "consumers_reviews": "With external cameras and radar sensors, we can track what's behind us when backing up, when another car or cars are  crossing  the back of our car, when we inadvertently cross over a lane marker, when another driver is moving in a 'blind spot', etc. We get 26 miles out a 110-volt overnight charge in the garage and, after 2 1/2 months we're averaging 180 mpg equivalent.\nStrangely, we have only seen one other Prime since we bought it, which makes us wonder if this is just an experimental car so that Toyota can collect data for future Prime models which will be nothing like the current 2017  version.", "Howhelpful": {"Yes": 7, "No": 0}, "evaluation": {"Comfort": 4.0, "Value for the Money": 4.0, "Interior Design": 3.0, "Reliability": 4.0, "Performance": 4.0, "Exterior Styling": 2.0, "overall": 4.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "PrimeFan\n", "title": "Glad I Bought It", "date": "Jun 11 2017", "consumers_reviews": "I wanted an electric car which would not put me in panic mode to find a charger. This electric/gas combination is perfect for my lifestyle. Right now I am getting 35 miles with a full charge, and seldom need more. Approaching 2,000 miles and just filled the gas tank the first time this week. (It did come full from the dealer.)\n\nI also wanted the safety features of the advanced model. However, the noise level can be somewhat annoying when backing into a tight garage space, but it certainly warns you when you are too close. The parking assist is truly amazing. I also find the headlights are much better than my old Prius. And the ride is very comfortable.\n\nMy only negatives are ? the navigation is a distant second to what my phone can do, and it takes some effort to get two bicycles in the back.\n\nThe big question is how the electric will perform in the winter and how will I like connecting/disconnecting the cord when the temp is below zero.", "Howhelpful": {"Yes": 4, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "soy76\n", "title": "Best Decision!", "date": "May 13 2017", "consumers_reviews": "I was originally set on another hybrid but after speaking to other prius owners, I took a test drive and was sold!! The finish is better and in EV mode the car just glides.  The incentives are great and when you factor them into the cost of the car, the value can't be beat!", "Howhelpful": {"Yes": 3, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "K\n", "title": "Prius Prime Advanced 2017 is Excellent!", "date": "May 10 2017", "consumers_reviews": "Recc Highly. Very impressed. \nToyota looks like nailed it with This incarnation of Prius. Def recc to go with Top Trim / Advanced with 2 tone interior. \nTechy Car. Has ALL / Multiple sensors / multiple driver assist features. \nIncluding Color Head up display etc along with Toyota Sense / Intelligent Cruise controle. \nAbility to control car AC remotely and check battery charge remotely - Very Nice.... \nPhone app for remote controls is rather slow, but get job done. \nDrives surprisingly peppy / given expectations ... \nElectric driving is very nice. \nWhen motor kicks in, sometimes rough, but tolerable. \nWish they included hatch motor close and not manual close \nAlso passenger seat adjust is not motorized / Only Driver's. \nFuel economy is Absolutely Stellar. \nGiven All Techno features INCLUDED - Price is Excellent and is a Great Buy. \nEspecially considering 4K Tax Federal rebate Plus Rebate from State.... \nALL in ALL Excellent Smart AND Fun Buy... \nHighly Recc....", "Howhelpful": {"Yes": 3, "No": 0}, "evaluation": {"Comfort": 4.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 3.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Tofusimons\n", "title": "I recommend the base (plus) model", "date": "Dec 16 2017", "consumers_reviews": "The base model is very well appointed: heated seats, nice fabric, soft steering wheel. The screen is plenty big, navigation (quaint), all the safety tech. Take a close look at the features you actually get for the premium and you'll realize all you're getting is a power driver seat (c'mon, you can pull a lever), fake leather (oooh) and what I consider to be an atrociously and superfluously huge screen. And you lose a volume knob and a cd player.", "Howhelpful": {"Yes": 3, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "soy76\n", "title": "Best Decision!", "date": "May 13 2017", "consumers_reviews": "I was originally set on another hybrid but after speaking to other prius owners, I took a test drive and was sold!! The finish is better and in EV mode the car just glides.  The incentives are great and when you factor them into the cost of the car, the value can't be beat!", "Howhelpful": {"Yes": 3, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "PeterB\n", "title": "Love the Prius Prime", "date": "Apr 05 2018", "consumers_reviews": "My wife and I are 1st generation Prius owners: we had a used 2001, traded for a new 2007 to have more space for our growing family; picked up a used 2013 V  when \"the other car\" died, and in 2018 bought a Prime when the 2007 died (215,000 miles). We still have the V for the family trips when we need the luggage space, but have been pleasantly surprised by how much the Prime can hold. And for performance, economy, styling and all around FUN, the Prime is far and away our favorite one yet. The all-electric acceleration is tremendous compared to the standard Prius. The ergonomics of the controls are superior to the past models. \"400 miles on 1/4 tank of gas\" is fun to say. We drive many short all-electric trip per week. Thanks Toyota for developing this amazing machine!", "Howhelpful": {"Yes": 2, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "crys58\n", "title": "Prius is a winner!", "date": "Apr 23 2017", "consumers_reviews": "The improvements for this vehicle is awesome. Lots of room and great handling. So improved, I bought one!", "Howhelpful": {"Yes": 2, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "HYPRMYLR\n", "title": "This car is off the scale !!!", "date": "Nov 24 2017", "consumers_reviews": "Having owned a 2007 Prius,  which was the best car I have ever owned, the Prius Prime  is off the scale in comparison. Magnificent car !!!", "Howhelpful": {"Yes": 2, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "Economist\n", "title": "Great car", "date": "Dec 08 2017", "consumers_reviews": "Let me say that I've only owned this car for a month. My husband has done most of the driving since I had flipped surgery and can't drive for six weeks. But that being said the ride is very comfortable, the styling inside and out is very comfortable and stylish.  I love the fact that the first 25 miles is electric so all of my local driving is electric only and uses no gas. Getting 60 miles to the gallon means that when I drive to Florida we only have to stop for gas once. The only option I would like to see is opening the hatchback\r\nthe use of your foot when you are carrying heavy packages \r\n One of my decisions in the purchase of this vehicle for the outstanding safety features", "Howhelpful": {"Yes": 2, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "miker\n", "title": "Plug-in great option for additional mpg", "date": "Mar 26 2018", "consumers_reviews": "Real life MPG (without plugging in) ranged between 63-68 April-November and about 50-54 December-March.  I drive with the aim of maximizing fuel economy and range.  With an 8.8 kWh capacity battery, the all electric range is only 25 miles.  I pay about $0.21 per kWh of electricity from Eversource MA; if we assume it really only uses 75% of the rated capacity and to recharge back to full requires only 6.6 kWh at $0.21, that translates to approximately $1.39.  This means the equivalent per gallon gasoline break-even price during the winter months is about $2.77 (6.6×0.21×50/25) and about $3.49 (6.6×0.21×63/25) during the warmer months.  At todays gasoline prices, it is clearly a great option if you can plug it in for free or for less than what it costs me for delivered electricity.", "Howhelpful": {"Yes": 2, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Prius", "title": "Great for running around town without using gas", "date": "Nov 25 2017", "consumers_reviews": "The car is very comfortable.  We bought the Advanced package, with all the bells and whistles.  The Safety Sense is very reassuring, particularly Blind Side Monitor and Rear Cross-Traffic warning.  The 11\" screen shows the road map very well.  The only negative is that there is no CD slot with the large screen.  It recharges in a matter of hours using standard household current.  We are getting 20-25 miles of Electrical mode on a charge.  We find the car very responsive.  It can be hard to keep within the speed limit, since you don't hear a motor revving.", "Howhelpful": {"Yes": 2, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "CarolynS.\n", "title": "Who would've guessed a Prius could look so snazzy?", "date": "Apr 07 2018", "consumers_reviews": "Loving my new Prius Prime!  It's absolutely beautiful in red, very sporty, and drives like a dream.  I've only had it for 500 miles so far, so I really can't speak to it's reliability, but so far everything's been great.  The electric motor lets me plug it in at night (to a regular outlet in my garage), and my commute to work and home is primarily electric, but it also generates electricity via the wheels, and the gas kicks in when going uphills.  I got up to 103 mpg the first week I owned it, and I can get even more whenever I'm just driving in town.  The gas gauge didn't budge all week, and the mpg just kept going up and up.   It's seamless, and so quiet, yet powerful, too.  My only disappointment was that there isn't more storage room.  The trunk and glove compartment are small, but, the high gas mileage is so worth it, and the seats fold down if I need to carry something bulky.  If you're at all tempted to buy a hydrid, I'd recommend looking at this one!!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Robhuff46\n", "title": "Great vehicle", "date": "Jun 14 2017", "consumers_reviews": "Great vehicle... Driven over 1000 miles, not using any gas.  Most of my driving is within 30 miles.  This is a hybrid plug-in.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "mjpburke60\n", "title": "Awesome piece of hardware.", "date": "Jan 02 2018", "consumers_reviews": "This car is absolutely spot on for our local EV needs. Had it now for 3 weeks and only used an 1/8th of a tank of gas. Currently showing 176.6 MPG. A blast to own and operate.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "KIRK\n", "title": "BEST CAR I OWNED", "date": "Oct 02 2017", "consumers_reviews": "GREAT GAS MILEAGE, THE VEHICLES SAFETY FEATURES ARE STANDARD. FINDING ELECTRIC STATIONS MAY BE A PROBLEM. XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "Judith", "title": "It's Red", "date": "Oct 04 2017", "consumers_reviews": "I have only had my car for a few weeks.  Compared to my 2007 Prius Touring my Advanced is more comfortable to drive, seating is more adjustable.  It has heated seats and steering wheel will be nice in winter.  The auto alert features take some getting used to, but do make it very safe.  Really nice if you live where there are a lot of bicyclist.  On the freeway the car pretty much drives itself.  It keeps the proper distance from the car in front. This car is as close as you can get to a self driving as you can presently get.  I have only used 1/4 tank of gas so far, the electric charge does fine for daily chores and work. This should get me to the grave with miles to spare!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does recommend this car!!"]}, {"name": "CarolynS.\n", "title": "Who would've guessed a Prius could look so snazzy?", "date": "Apr 07 2018", "consumers_reviews": "Loving my new Prius Prime!  It's absolutely beautiful in red, very sporty, and drives like a dream.  I've only had it for 500 miles so far, so I really can't speak to it's reliability, but so far everything's been great.  The electric motor lets me plug it in at night (to a regular outlet in my garage), and my commute to work and home is primarily electric, but it also generates electricity via the wheels, and the gas kicks in when going uphills.  I got up to 103 mpg the first week I owned it, and I can get even more whenever I'm just driving in town.  The gas gauge didn't budge all week, and the mpg just kept going up and up.   It's seamless, and so quiet, yet powerful, too.  My only disappointment was that there isn't more storage room.  The trunk and glove compartment are small, but, the high gas mileage is so worth it, and the seats fold down if I need to carry something bulky.  If you're at all tempted to buy a hydrid, I'd recommend looking at this one!!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "ShawnS\n", "title": "Best of both worlds--EV & Hybrid", "date": "Sep 18 2017", "consumers_reviews": "Fun to watch the (lack of) movement of the gas gauge.  Most of my trips are within the car's EV range.  Have driven about 600 miles thus far and estimate I have used about a gallon of gas.  Lots of safety bells and whistles (parks itself, has a blind spot monitor, dynamic radar cruise control, etc.) Down side:  No rear windshield wiper, which affects visibility out the back window, and not a lot of luggage space.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "RobertDc\n", "title": "Favorite Car", "date": "Apr 21 2018", "consumers_reviews": "So far this is by far the best car I have ever owned.  And my previous car was a 2016 Toyota Prius. It is the most wonderful color. It is by far the smoothest ride I have ever enjoyed compared with all my past autos. I love the space age interface. I feel it is well laid out and easy and quick to access all the needed functions.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Dennisimo\n", "title": "Great car for the family", "date": "Dec 08 2017", "consumers_reviews": "The 5 main reasons I went with the Prime was I can drive in HOV by myself, the $6000 of Fed & State rebates, the nearly $10,000 I would save in 6 years by trading my existing car for the Prime, the fun ride and crazy amount of safety features.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Davidstress\n", "title": "High Tech Wonder", "date": "Aug 31 2017", "consumers_reviews": "So many amazing high tech features it really needs to be appreciated by an Engineer.\nLove the big screen, love the HUD, love having 2 real seats in the back without trying to shoehorn in a 3rd.\nDid I say I love the look, both inside and out.  But you do need the center console applique package to get rid of the urinal look.  Easy to install if you are handy.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "Environmentalist\n", "title": "REALLY SMOOTH", "date": "Nov 07 2017", "consumers_reviews": "The car moves out quietly and smoothly. It handles easily and the ride is quite comfortable. It has plenty of acceleration.\r\nAll said, I enjoy driving this car. In addition the safety warnings are most helpful and give peace of mind. We were backing out of a parking spot and it let us know that a car had turned into our lane (in a parking lot) ; it did stop before getting very far but it was reassuring to have that kind of warning.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 3.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does recommend this car!!"]}, {"name": "Jim\n", "title": "2017 Prius Prime Advanced", "date": "Feb 08 2018", "consumers_reviews": "The car gives a good solid, quiet ride. The interior is stylish and comfortable. The 11.6 inch display and entune premium (JBL) audio with integrated navigation and app suite was great on my 1,000 mile trip down the eastern seaboard. Toyota safety sense package worked great on my long trip and around town. The full-speed range dynamic radar cruise control is my favorite feature when freeway driving. Gas mileage was 54 mph in hybrid mode traveling down I-95 interstate. Around town I can drive on electric for a good 30 miles before recharging. Great value for the money.  Love the car", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does not recommend this car!!"]}, {"name": "Robhuff46\n", "title": "Great vehicle", "date": "Jun 14 2017", "consumers_reviews": "Great vehicle... Driven over 1000 miles, not using any gas.  Most of my driving is within 30 miles.  This is a hybrid plug-in.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "wolfpup77\n", "title": "Plug-in Hybrid that checks all the boxes", "date": "Oct 09 2017", "consumers_reviews": "I have driven this vehicle for about six weeks and it's met my expectations.  The fuel economy is amazing; I so far have garnered about 98 MPG with a combination of half EV and half gas driving commuting sixty miles round-trip to and from work five times a week.  The advertised 24 miles of electric range is conservative; I've gone as much as 31 miles.  The styling, in my subjective opinion,  is beautiful, and vastly improves the frumpy styling of past Priuses, even the new generation.  The fact that I will be getting a $4,502 tax credit next year due to this vehicle being a \"green\" car further extends the awesome value of this vehicle as a whole.  The thought of plugging in the car every night at first seemed like such a burden, but after a few charges it has become a routine activity that takes about a minute each time; the reward of pure electric power is enough for me to anticipate the release of the plug every time I do it!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Mugsy\n", "title": "Prius Prime", "date": "Aug 31 2017", "consumers_reviews": "The most comfortable car I have ever had and that is many!\r\nI feel very safe in it, all the controls are easy to maneuver right in front of me.  I love the styling and color.  Everything about this car is perfect!!!!!!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "mjpburke60\n", "title": "Awesome piece of hardware.", "date": "Jan 02 2018", "consumers_reviews": "This car is absolutely spot on for our local EV needs. Had it now for 3 weeks and only used an 1/8th of a tank of gas. Currently showing 176.6 MPG. A blast to own and operate.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "TerryJ\n", "title": "A wonderfully economical vehicle", "date": "Dec 01 2017", "consumers_reviews": "I purchased my Prius Prime in May, 2017.  I currently have 5K miles on it and have used about 5 tanks of gas; mainly used on long trips.  In the summer the electric charge takes me about 35 mi which is good enough for my daily errands (about 28 mi); in the winter the range is closer to 26 mi which means I burn some gas.  On a recent trip for So. OR to No CA of about 1K mi; I used both electric and gas (hybrid) and got about 68 mpg.  The cost of electricity ends up to be about $1.76 per gallon.  This is my fifth Prius; first plugin hybrid.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Dennisimo\n", "title": "Great car for the family", "date": "Dec 08 2017", "consumers_reviews": "The 5 main reasons I went with the Prime was I can drive in HOV by myself, the $6000 of Fed & State rebates, the nearly $10,000 I would save in 6 years by trading my existing car for the Prime, the fun ride and crazy amount of safety features.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Hot", "title": "Good for the Planet, Great Drive, Sporty Look", "date": "Feb 12 2018", "consumers_reviews": "I've only had my Prius Prime for two weeks but I love it. I like having the easy plug-in that only requires a standard household three-prong-plug, and the instant transfer to gas-powered hybrid I was used to with my reliable 2005 Prius with 210,000 miles my husband is now driving. The 2017 Prius Prime has almost every safety feature available--from radar that detects someone walking in front of the car and lets you set a determined distance between your car and the one you are following and will slow your car if that car slows, detecting people walking on the side of the road and if you have gotten too close to the median line and beeps at you, or detecting a car coming from the side if you are backing out and can't see. It was hard to see out the back of my 2005 Prius but this car has a larger rear window and better view, but also has a compete back-up camera. All this and comfort and what a friend calls its wonderful Hot Momma Red color. A great buy, especially with the $4500 Federal tax rebate and the Massachusetts $1500 Electric Car immediate rebate. With the 25 miles on electricity gas consumption is low, making the Prius a truly climate-friendly car.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 4.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does recommend this car!!"]}, {"name": "CarolynS.\n", "title": "Who would've guessed a Prius could look so snazzy?", "date": "Apr 07 2018", "consumers_reviews": "Loving my new Prius Prime!  It's absolutely beautiful in red, very sporty, and drives like a dream.  I've only had it for 500 miles so far, so I really can't speak to it's reliability, but so far everything's been great.  The electric motor lets me plug it in at night (to a regular outlet in my garage), and my commute to work and home is primarily electric, but it also generates electricity via the wheels, and the gas kicks in when going uphills.  I got up to 103 mpg the first week I owned it, and I can get even more whenever I'm just driving in town.  The gas gauge didn't budge all week, and the mpg just kept going up and up.   It's seamless, and so quiet, yet powerful, too.  My only disappointment was that there isn't more storage room.  The trunk and glove compartment are small, but, the high gas mileage is so worth it, and the seats fold down if I need to carry something bulky.  If you're at all tempted to buy a hydrid, I'd recommend looking at this one!!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Judith", "title": "It's Red", "date": "Oct 04 2017", "consumers_reviews": "I have only had my car for a few weeks.  Compared to my 2007 Prius Touring my Advanced is more comfortable to drive, seating is more adjustable.  It has heated seats and steering wheel will be nice in winter.  The auto alert features take some getting used to, but do make it very safe.  Really nice if you live where there are a lot of bicyclist.  On the freeway the car pretty much drives itself.  It keeps the proper distance from the car in front. This car is as close as you can get to a self driving as you can presently get.  I have only used 1/4 tank of gas so far, the electric charge does fine for daily chores and work. This should get me to the grave with miles to spare!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does recommend this car!!"]}, {"name": "Jim\n", "title": "2017 Prius Prime Advanced", "date": "Feb 08 2018", "consumers_reviews": "The car gives a good solid, quiet ride. The interior is stylish and comfortable. The 11.6 inch display and entune premium (JBL) audio with integrated navigation and app suite was great on my 1,000 mile trip down the eastern seaboard. Toyota safety sense package worked great on my long trip and around town. The full-speed range dynamic radar cruise control is my favorite feature when freeway driving. Gas mileage was 54 mph in hybrid mode traveling down I-95 interstate. Around town I can drive on electric for a good 30 miles before recharging. Great value for the money.  Love the car", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does not recommend this car!!"]}, {"name": "Robhuff46\n", "title": "Great vehicle", "date": "Jun 14 2017", "consumers_reviews": "Great vehicle... Driven over 1000 miles, not using any gas.  Most of my driving is within 30 miles.  This is a hybrid plug-in.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "bevpalrn\n", "title": "most efficient and beautiful car we've driven", "date": "Oct 02 2017", "consumers_reviews": "{don't tell anyone but we are getting more miles per charge than stated at the dealer or in the manual}  other than being a little low to the ground making it slightly more work getting in and out  {at 75 yrs old} we absolutely love it and are adding extras to it  ie: clear doorcups to protect  behind the door handles - from scratches thru the yrs, etc.  the rebates from the state and eventually from the govt. at tax time, make it a no brainer to buy this rather than the wonderful hybrid we've owned in the past.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "Mugsy\n", "title": "Prius Prime", "date": "Aug 31 2017", "consumers_reviews": "The most comfortable car I have ever had and that is many!\r\nI feel very safe in it, all the controls are easy to maneuver right in front of me.  I love the styling and color.  Everything about this car is perfect!!!!!!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "KIRK\n", "title": "BEST CAR I OWNED", "date": "Oct 02 2017", "consumers_reviews": "GREAT GAS MILEAGE, THE VEHICLES SAFETY FEATURES ARE STANDARD. FINDING ELECTRIC STATIONS MAY BE A PROBLEM. XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "mjpburke60\n", "title": "Awesome piece of hardware.", "date": "Jan 02 2018", "consumers_reviews": "This car is absolutely spot on for our local EV needs. Had it now for 3 weeks and only used an 1/8th of a tank of gas. Currently showing 176.6 MPG. A blast to own and operate.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "TerryJ\n", "title": "A wonderfully economical vehicle", "date": "Dec 01 2017", "consumers_reviews": "I purchased my Prius Prime in May, 2017.  I currently have 5K miles on it and have used about 5 tanks of gas; mainly used on long trips.  In the summer the electric charge takes me about 35 mi which is good enough for my daily errands (about 28 mi); in the winter the range is closer to 26 mi which means I burn some gas.  On a recent trip for So. OR to No CA of about 1K mi; I used both electric and gas (hybrid) and got about 68 mpg.  The cost of electricity ends up to be about $1.76 per gallon.  This is my fifth Prius; first plugin hybrid.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Judith", "title": "It's Red", "date": "Oct 04 2017", "consumers_reviews": "I have only had my car for a few weeks.  Compared to my 2007 Prius Touring my Advanced is more comfortable to drive, seating is more adjustable.  It has heated seats and steering wheel will be nice in winter.  The auto alert features take some getting used to, but do make it very safe.  Really nice if you live where there are a lot of bicyclist.  On the freeway the car pretty much drives itself.  It keeps the proper distance from the car in front. This car is as close as you can get to a self driving as you can presently get.  I have only used 1/4 tank of gas so far, the electric charge does fine for daily chores and work. This should get me to the grave with miles to spare!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does recommend this car!!"]}, {"name": "Dennisimo\n", "title": "Great car for the family", "date": "Dec 08 2017", "consumers_reviews": "The 5 main reasons I went with the Prime was I can drive in HOV by myself, the $6000 of Fed & State rebates, the nearly $10,000 I would save in 6 years by trading my existing car for the Prime, the fun ride and crazy amount of safety features.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "tway930\n", "title": "BEST CAR EVER!!", "date": "Aug 18 2018", "consumers_reviews": "The perfect balance between performance and fuel efficiency!  Lots of power, battery charges overnight on 110v and I’m currently averaging over 100 mpg!  LOVE the tablet sized screen which operates almost every system. My iPhone connects easily and music and audio books sound great!  This car is actually pretty perfect!  I bought mine and my husband loved it so much we went back and bought one for him!!", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Keith", "title": "Prius Prime: Impressive mpg and mileage", "date": "Apr 18 2018", "consumers_reviews": "I have been using this new car for third week now. Its mileage reaches more than 500 miles and the tank still is more than half.  As of today, its mpg is 74 which is impressive.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "archphips\n", "title": "lots of technology for little money", "date": "Nov 09 2017", "consumers_reviews": "The Prime offers exceptional gas mileage and range combined with the option to drive short commutes entirely in electric mode.  The exterior design takes getting used to and is overly showy but the interior is comfortable and mostly quite functional in spite of the many options and choices this vehicle offers including dynamic cruise control, lane control and automatic emergency breaking. \nThe car is quite responsive in its quiet way  getting up to speed with its CVT transmission.\nThe Prime beats the Volt in price and the Hyandai Ionic in company experience with plug-ins.\nI have it only for a few days, so I can't say anything about reliability", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 3.0, "Exterior Styling": 2.0, "overall": 4.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "genoecondrive\n", "title": "Terrific  plug in milage", "date": "Aug 17 2017", "consumers_reviews": "Replaced 2010 Prius with 3017  Prius Prime Premium and very satisfied overall. Getting  200 mpg for our driving patterns and 25-30 miles in EV mode. Truly a car of the future. Much better drive than old Prius with a $4,500 rebate makes it a good value.  Purchased it in N.J. avoiding conveyance fees and dealer costs in surrounding States.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 4.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "bevpalrn\n", "title": "most efficient and beautiful car we've driven", "date": "Oct 02 2017", "consumers_reviews": "{don't tell anyone but we are getting more miles per charge than stated at the dealer or in the manual}  other than being a little low to the ground making it slightly more work getting in and out  {at 75 yrs old} we absolutely love it and are adding extras to it  ie: clear doorcups to protect  behind the door handles - from scratches thru the yrs, etc.  the rebates from the state and eventually from the govt. at tax time, make it a no brainer to buy this rather than the wonderful hybrid we've owned in the past.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "xmasboy\n", "title": "Best Prius yet!", "date": "Sep 23 2017", "consumers_reviews": "This is my fourth Prius, but the first that is a plug-in. This car is amazing. It is comfortable, stylish and fun to drive. I’m currently getting about 140 mpg. I do have access to free charging at my workplace which makes it even that much more appealing.", "Howhelpful": {"Yes": 1, "No": 0}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Mark", "title": "Prius Prime---A Tesla you can afford", "date": "Apr 15 2017", "consumers_reviews": "I mean nothing derogatory by the title.  I  have driven the Tesla and it's a wonderful car, but far out of the price range of most buyers.  The Prius Prime is a very practical alternative to the pricey \"battery only\" products currently available.  \n\nFor around 30 K you can own a car that, depending on your driving, will never need fuel.  Yes, if you drive 25 miles or less per day and charge daily you will never need to buy gas again.  If you charge nightly and drive 25 miles to work one way, the return trip will only burn 1/2 gallon of gas to drive 50 miles.   That's about 100 miles per gallon plus the cost of one charge.  I estimate about 1.50 per charge.    As of this writing we have just about 1000 miles on the car and have only burned one tank of gas.  That was for a 400 mile trip my wife took.\n\nIt has a lot more power and handles better than other Prius's I have driven.   It comes in 3 model levels.  I have the premium level which features a (Tesla like) glass panel that controls the radio, the GPS and environment.  \n\nOverall it's been a fun ride and if it performs long-term like the other Toyota's I have owned, it's going to be a great choice of a car.  \n\nSo if you're interested in a car that gives you the benefits of a battery driven vehicle without the possibility of being stuck with a dead battery, that's an affordable alternative, this might be worth looking into.", "Howhelpful": {"Yes": 11, "No": 1}, "evaluation": {"Comfort": 4.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Vtpapa\n", "title": "Great cars, lots of safety features", "date": "May 03 2017", "consumers_reviews": "Headline pretty much says it all.  The cross traffic alert, blind spot monitoring, lane departure warnings, and all the other technology is very comforting.  The exterior styling, and the  \"moon stone\" interior do not make you think Prius, but the MPG and the plug in capability definitely make it a Prius.", "Howhelpful": {"Yes": 5, "No": 1}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "DaytonBill\n", "title": "Prius Prime Premium a Great Addition for Toyota", "date": "May 15 2017", "consumers_reviews": "I have driven Prius models since they came to the US and I find they are outstanding vehicles.  The new Prius Prime is no exception.  My experience is, with some conservative driving, the EV mode will stretch beyond the published 24 miles and the hybrid mode is better on gas than the manufacturer says. \n \nCompared to the standard Prius, the Prime has a much improved styling, but less cargo space due to the large battery, and seats only 4 people instead of the normal 5.\n\nThe navigation system is good, but the voice recognition is poor, at best.  Once the destination is entered into the system it works great.  The ability to search the internet for an address is limited to only when the vehicle is stopped and cannot be used to change destinations on the fly.  I believe that makes the use of the navigation system somewhat limited.", "Howhelpful": {"Yes": 5, "No": 1}, "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does recommend this car!!"]}, {"name": "jeh\n", "title": "Best Car We've Owned", "date": "Mar 14 2018", "consumers_reviews": "My husband is able to make his 47-mile roundtrip commute entirely in electric vehicle mode, greatly increasing our average miles-per-gallon as well as the cost-effectiveness of the purchase and reducing our carbon footprint.  The auto-assist features make driving less stressful, and we get lots of compliments on the car's appearance and comfort.  We've owned Hondas, an Izusu, an Infinity, a Chevy, a Volvo, and other Toyota models, but we enjoy driving this car more than any other.", "Howhelpful": {"Yes": 1, "No": 1}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "M\n", "title": "The car of the futureooo.", "date": "Jul 01 2017", "consumers_reviews": "I think you are for someone who go to work everyday out of town or just shopping if your day with your son silver everything's perfect", "Howhelpful": {"Yes": 1, "No": 3}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Prius\n", "title": "Good gas milage", "date": "Jan 03 2018", "consumers_reviews": "Not a very comfortable car, seat does not adjust sufficiently for short person to see and drive safely!", "Howhelpful": {"Yes": 0, "No": 2}, "evaluation": {"Comfort": 3.0, "Value for the Money": 4.0, "Interior Design": 2.0, "Reliability": 4.0, "Performance": 4.0, "Exterior Styling": 5.0, "overall": 3.0}, "context": ["Purchased a New car", "Uses car for Transporting family", "Does not recommend this car!!"]}, {"name": "MM\n", "title": "LOVE the versatility of Prius Prime", "date": "Apr 15 2018", "consumers_reviews": "I love the EV capabilities of my plug-in hybrid Prius Prime. I cannot wait to start using this car every day. I'll definitely rack up the EV miles by charging it. I'll be very happy when I realize how little gas I'm using each month.", "Howhelpful": {"Yes": 0, "No": 1}, "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "ThreePs\n", "title": "PPP", "date": "Jan 23 2018", "consumers_reviews": "The Prius Prime Premium is sporty and runs well, however, I would not recommend it to anyone who lives in upper Westchester or to anyone who has Con Ed , nor to anyone without a dedicated accessible outlet . \r\n The outlet installation costs $350. There are virtually no charge stations available in the vicinity of my home. Con Ed's fees are very high. \r\nIt may be my ideal car in the future when a plug in is cheaper and readily available. For now, though, I overpaid fro a feature that is too expensive to use.", "Howhelpful": {"Yes": 0, "No": 1}, "evaluation": {"Comfort": 4.0, "Value for the Money": 3.0, "Interior Design": 3.0, "Reliability": 4.0, "Performance": 4.0, "Exterior Styling": 3.0, "overall": 4.0}, "context": ["Purchased a New car", "Uses car for Just getting around", "Does not recommend this car!!"]}, {"name": "admflr\n", "title": "Very comfortable and reliable, but not sporty!", "date": "Jan 02 2018", "consumers_reviews": "I've owned my Prius Prime for a few months now. I absolutely love the interior styling, including the 7\" touch screen. Most of the controls are intuitive, however some aspects require some getting used to. My only real gripe so far is that the vehicle is so under-powered, that it becomes somewhat embarrassing trying to not slow down too much going up hills when there is a car behind me. Obviously this was done on purpose to make the car more efficient, which is good.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 4.0, "overall": 4.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Cjames\n", "title": "Awesome car, great gas mileage", "date": "May 14 2018", "consumers_reviews": "This car is perfect. Great gas mileage! It's safe. It has great technical specs! Plenty of room, comfy. It's nice to have the rear view camera too", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "My", "title": "Really nice", "date": "Aug 05 2017", "consumers_reviews": "I've owned this car for less than a week but I love it. I know lots of people think this is an ugly car but I really like the look. I got it in blue magnetism and it really stands out. So far the drive is quiet and it's more powerful than my old Camry", "Howhelpful": "", "evaluation": {"Comfort": 4.0, "Value for the Money": 4.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 4.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "PriusPrime17\n", "title": "Electric/Hybrid Combo", "date": "Aug 17 2018", "consumers_reviews": "Great for short travel in and around town, economical even for long travel. Host of tech yet easy to use for everyone. Fairly roomy and good storage for a mid size car.", "Howhelpful": "", "evaluation": {"Comfort": 4.0, "Value for the Money": 4.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Primefan\n", "title": "Great car.", "date": "Aug 13 2018", "consumers_reviews": "I love everything about this car except the trunk space and the fact that it only has 4 seats.\nNot using gas for weeks is amazing. The safety sense is fantastic.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Sheldon", "title": "Great gas mileage", "date": "Oct 10 2017", "consumers_reviews": "The car is a pleasure to drive. I love the MPG and all the safety features. I am up to 87 miles per gallon with daily charging. Can't believe it.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "Rojo", "title": "Plug it In!", "date": "Jun 22 2017", "consumers_reviews": "Prius hybrid is my choice of vehicle and this one is better than the one I traded in.  It's a plug in and the styling has been updated to give it a more racy look.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Primefan\n", "title": "Great car.", "date": "Aug 13 2018", "consumers_reviews": "I love everything about this car except the trunk space and the fact that it only has 4 seats.\nNot using gas for weeks is amazing. The safety sense is fantastic.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 4.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "PriusPrime17\n", "title": "Electric/Hybrid Combo", "date": "Aug 17 2018", "consumers_reviews": "Great for short travel in and around town, economical even for long travel. Host of tech yet easy to use for everyone. Fairly roomy and good storage for a mid size car.", "Howhelpful": "", "evaluation": {"Comfort": 4.0, "Value for the Money": 4.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Prius", "title": "My second Prius", "date": "Nov 15 2018", "consumers_reviews": "It is a very good car especially for fuel saving, comfort and reliability.  I drive 2x as much as the average driver vlocking 24k miles in a year. This is my second prius. I drive the first one to 200,000 miles plus and was enticed to new bluetooth technology for safety and a lot more safety features for increased visibilty, parking assist and other assistive features.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Rojo", "title": "Plug it In!", "date": "Jun 22 2017", "consumers_reviews": "Prius hybrid is my choice of vehicle and this one is better than the one I traded in.  It's a plug in and the styling has been updated to give it a more racy look.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 4.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "Tommydude\n", "title": "Saved Tons of Gas with all the essential features", "date": "Oct 20 2018", "consumers_reviews": "Say goodbye to Gas if your daily drives is within 20 miles.  It has all the modern essential features and technology.  Tons of Rebates from Federal, State and even Edison still.  Can't go wrong with this car the only thing I wish it could improve is its battery range and only a 4 seater.", "Howhelpful": "", "evaluation": {"Comfort": 4.0, "Value for the Money": 5.0, "Interior Design": 4.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 4.0, "overall": 5.0}, "context": ["Purchased a New car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "gaming\n", "title": "I loved owning.", "date": "Nov 06 2018", "consumers_reviews": "This car is everything I need. The car saves lots of money and my family loves it because it has wide space to travel around with friends and family.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 0.0, "Performance": 4.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Does recommend this car!!"]}, {"name": "Rich", "title": "I look Forward to Driving Again!", "date": "Nov 22 2019", "consumers_reviews": "This is my third Prius and this one takes the cake! It's like driving a video game with loads of data and feedback about fuel economy and energy use, EV vs. gas. I'm sitting at 197 mpg for the last three weeks (since I bought the car) based on 82% EV use. I bought the Premium trim model. I'm 6' 6\" tall and never had so much room with the power seats for leg and head room. Electric power is wonderful and even when the 28+ mile EV is used up the battery still isn't dead. It recharges quite a bit in hybrid/gas mode to squeeze out many more EV miles as you go. This car challenges you to break your own record for fuel economy but in a fun way.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a Used car", "Uses car for Commuting", "Does recommend this car!!"]}, {"name": "MelissaC12\n", "title": "Another Great Prius", "date": "Jan 01 2020", "consumers_reviews": "This is my third Prius and I love it. Beautiful styling. Great performance. Reasonable price. Handling is excellent. I bought the Advanced and it is worth it.", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a Used car", "Uses car for Having fun", "Does recommend this car!!"]}, {"name": "Gizzmoe\n", "title": "Best buy ever!", "date": "Feb 14 2020", "consumers_reviews": "This car has met and exceeded my expectations! My wife is almost ready to trade her Prius in. The Prius Prime will be at the top of our list!", "Howhelpful": "", "evaluation": {"Comfort": 5.0, "Value for the Money": 5.0, "Interior Design": 5.0, "Reliability": 5.0, "Performance": 5.0, "Exterior Styling": 5.0, "overall": 5.0}, "context": ["Purchased a Used car", "Uses car for Having fun", "Does recommend this car!!"]}]}]