[{"img": "https://media.ed.edmunds-media.com/mini/countryman/2017/oem/2017_mini_countryman_wagon_cooper-s-all4_fq_oem_10_815.jpg", "whatsnew": "", "whyrecommend": "There's no doubt the standard Countryman Cooper is a good deal; smaller Mini models such as the four-door Hatchback and Clubman have a similar price when equipped to the Countryman's starting configuration. Though the base three-cylinder Cooper engine is perfectly acceptable in the smaller Minis, it might be a bit outmatched if you're frequently using the heavier Countryman to haul around people and cargo. We'd go with the Cooper S. The significant increase in performance (Mini estimates a 2-second difference in the sprint from zero to 60 mph) makes it worth the upgrade in our eyes, and we expect fuel economy between the two engines to be very similar.", "overall-review": "What do you do when you love the exciting  driving dynamics of the playful Mini Hatchback but need more passenger and  cargo space than it provides? Luckily, the 2017 Mini Countryman embodies the  spirit of its diminutive siblings in a package that makes it easy to share that  experience with your friends and family. \nThe fully redesigned Mini Countryman is  longer and wider than its predecessor, with more headroom, legroom and cargo  room than before. The base four-cylinder engine in the previous model has been  replaced by the turbocharged three-cylinder found in other Minis, while the  optional turbo-four offers more horsepower and torque. Current-generation Mini  interior design is finally incorporated into the Countryman; the speedometer is  now in a normal position in front of the driver and the central display is now  a touchscreen. \nThe 2017 Mini Countryman retains the  features that made us like it in the first place. The 40/20/40-split second row  slides and reclines, allowing rear passengers to make full use of the compact  dimensions. Interior materials look and feel like they are worth the price  premium Minis command. The stylized cabin design is also undoubtedly more  interesting than those of the Countryman's reserved rivals. Whether you view it  as a family-friendly Mini or simply a unique alternative to competing small  crossovers, the 2017 Countryman is ready to take you on your next adventure.\nThe 2017 Mini Countryman is a sporty and  fun alternative to the standard set of small crossovers and wagons. The  Countryman earns the premium price tag it carries by offering a substantial  list of standard features, and a plethora of available options allows buyers to  customize the Countryman to their heart's content. The two trims,  Cooper and  Cooper S,  have similar feature content but are differentiated by the engines underhood.  Whichever you get, you'll be rewarded by a Mini that prioritizes passenger  space and driving thrills in equal measure. \nPowering  the base front-wheel-drive Cooper trim  is a turbocharged 1.5-liter three-cylinder engine (134 horsepower, 162  pound-feet of torque) matched to your choice of a six-speed manual or six-speed  automatic transmission. On the all-wheel-drive Countryman All4, the automatic  transmission has eight speeds.\nYou  get a lot of features with the Countryman, including 17-inch wheels, summer  performance tires, automatic wipers, heated mirrors, a heated windshield wiper  system, roof rails, a panoramic sunroof, keyless entry and ignition, a rearview  camera, rear parking sensors, adjustable driving modes, height-adjustable front  seats, 40/20/40-split rear seats, faux leather upholstery, dual-zone automatic  climate control, ambient lighting, Bluetooth, a 6.5-inch display screen and a  six-speaker audio system. \nOur  pick is the Cooper S, though. It has  a peppy turbocharged 2.0-liter four-cylinder engine (189 hp, 207 lb-ft) mated  to a six-speed manual or an eight-speed automatic. It also gets 18-inch wheels,  LED headlights and foglights, and heated front sport seats. All-wheel drive is  optional.\nThough  both Cooper and Cooper S typically draw from the same pool of options packages,  the Sport package is unique to the  Cooper. It includes the 18-inch wheels, LED headlights and foglights, and sport  seats from the Cooper S, along with adaptive suspension dampers. The Cooper's Cold Weather package adds heated front  seats and an auto-dimming rearview mirror.\nEvery  other package can be outfitted to either model. For those looking for  additional luxury and storage features, there's the Convenience package (rear armrest, vehicle alarm, cargo divider,  and a choice between a cargo area flip-out seating cushion or spare tire) and Premium package (power-adjustable front  seats, a 12-speaker Harman Kardon audio system, tinted glass and a hands-free  power liftgate). The Technology package  includes a wealth of upgrades, including an 8.8-inch touchscreen, navigation, a  head-up display, wireless phone charging and an automated parallel parking  system. The Fully Loaded package  includes all four above packages plus satellite radio and the Cold Weather  package.\nIf  appearance-oriented upgrades are more your thing, the John Cooper Works Interior package includes a unique steering  wheel, sport seats (if not already equipped), a black headliner and JCW-branded  decorations, while the JCW Exterior package adds 18-inch wheels, a rear spoiler, additional stability control  choices and aerodynamic modifications.\nMany  of the above options can be ordered separately. Additional stand-alone options  include 19-inch wheels, all-season tires, leather upholstery,  steering-wheel-mounted paddle shifters (automatic-equipped Cooper S models  only), and exterior and interior styling modifications.", "overall-score": "4.0 / 5", "maker": "MINI", "model": "countryman", "production_year": "2017", "price": "", "trending_topic": {"pros": ["safety"], "cons": ["value", "maintenance & parts", "interior", "reliability & manufacturing quality", "transmission", "lights", "cup holders", "appearance", "doors", "sound system", "dashboard", "handling & steering", "steering wheel", "infotainment system", "road noise", "brakes", "warranty", "oil", "fuel efficiency", "driving experience"]}, "pros": ["Exterior and interior design sets it apart from competitors", "Materials are of a higher quality than those of subcompact rivals", "One of the only vehicles of its kind with a manual transmission", "Provides a sporty driving experience"], "cons": ["Front seats are confining and won't be comfortable for everyone", "Cargo area is small compared to almost every rival's", "Both engines require premium fuel"], "expert": {"Driving": [{"class": "Driving-overall", "score": 4.0, "expert_review": "The Countryman Cooper S is more entertaining to drive than most traditional compact crossovers, but it's not as quick as luxury alternatives such as the BMW X1 and Volvo V60. It splits the difference between these two groups in most other performance-related areas as well."}, {"class": "Acceleration", "score": "3.0", "expert_review": "Even though this is the sporty Cooper S model, the Countryman feels sluggish at partial throttle in Green and Mid driving modes. It's not until you select Sport that it feels like it's got some pep. It doesn't rocket off the line, but we were achieved a decent 0-60-mph time of 7.2 seconds."}, {"class": "Braking", "score": "3.0", "expert_review": "Brake pedal has a light to moderate amount of resistance, with good initial bite when you tap into the pedal. It's not grabby, however, and stopping force feels linear with effort. It came to a halt from 60 mph in 117 feet, average against standard crossovers and a bit long versus luxury rivals."}, {"class": "Steering", "score": "4.5", "expert_review": "True to Mini's sporting intentions, steering effort is a little heavier than in competitors. Effort doesn't change while cycling through driving modes, but the car feels quicker to react in Sport. Feels good at highway speeds; you don't need to make corrections to keep the car tracking straight."}, {"class": "Handling", "score": "4.5", "expert_review": "The Countryman is more fun to zip around turns in than most other cars in this class, but it's best to think of it as a sporty alternative to small crossovers and wagons rather than a large Mini. It doesn't quite live up to those expectations. Feels like there's more body roll than in a Mazda CX-5."}, {"class": "Drivability", "score": "4.0", "expert_review": "The clutch is easy to operate, with a catch point just off the floor, so you barely have to ease up before forward movement ensues. The clutch pedal isn't heavy, either. Shifter throws are a little long and rubbery, but it's easy to find the right gate. Cruise control reduces set speed when turning."}], "Comfort": [{"class": "Comfort-overall", "score": 3.0, "expert_review": "The Countryman exhibits a degree of comfort that is surprising given Mini's sporting reputation. The ride is rarely choppy, and the cabin is typically fairly quiet. The rear vents help keep rear passengers happy. Aggressively bolstered front seats and heat-trapping upholstery are major drawbacks."}, {"class": "Seat comfort", "score": "2.0", "expert_review": "The side bolsters on these seats are thick and don't move much during hard cornering. However, the seatback and bottom are narrow, making it nearly impossible to not rest your legs on the thigh bolsters. Many people will find them too confining. Milder seats are not available."}, {"class": "Ride comfort", "score": "3.5", "expert_review": "The ride is surprisingly comfortable, even with large 18-inch wheels and run-flat tires. It feels a bit livelier than you might expect from some competitors, but it's supple by Mini standards. Adaptive dampers are available if you want to choose your own adventure."}, {"class": "Noise & vibration", "score": "3.0", "expert_review": "There's not much wind noise, and even tire noise is reasonably quelled. The sunroof covers rattle if they're closed and you hit a bump, but move them slightly out of place and that'll disappear. The engine stop-start system sends a shudder through the cabin when it kicks on."}, {"class": "Climate control", "score": "3.0", "expert_review": "Auto climate control has to work hard to cool the cabin and counteract heat radiating from the panoramic sunroof on a hot day. Temperature adjustments are in 2-degree increments. Seats don't breathe well, but the cloth/faux leather coverings may still be better than non-cloth seats in warm climes."}], "Interior": [{"class": "Interior-overall", "score": 3.0, "expert_review": "The Countryman boasts a sense of roominess that you won't find in other Minis. There are thoughtful touches such as an instrument panel that moves with the steering wheel and folding rear headrests. There are some ergonomic issues, including an awkwardly located seatback tilt lever and lumbar knob."}, {"class": "Ease of use", "score": "3.0", "expert_review": "Most things up front are easy to reach, from the toggle switches to infotainment system controller. The awkward lumbar knob, located on the inboard side of the seatback, is an exception. The door-mounted armrests are at a perfect length, but there's no rear center armrest."}, {"class": "Getting in/getting out", "score": "3.0", "expert_review": "The Countryman has a step-in height that's slightly taller than that of high-riding hatchbacks such as the Mercedes GLA-Class and BMW X1, so you don't fall down into the seat when you enter. That said, ingress and egress aren't quite effortless; large seat bolsters can make hard to exit the front."}, {"class": "Driving position", "score": "3.5", "expert_review": "The front seats allow plenty of fore, aft and height travel, ensuring drivers of any size will be able to find a good position. Eventually, that is, as the headrests are angled too far forward and the clutch pedal travel is long, making it difficult to find a comfortable setup initially."}, {"class": "Roominess", "score": "3.0", "expert_review": "Tall people will find there's an abundance of headroom up front, even with the panoramic sunroof. Shoulder room is lacking due to the aforementioned seat bolsters. There's decent legroom and headroom in the back, and the front seatback is sculpted for extra kneeroom."}, {"class": "Visibility", "score": "5.0", "expert_review": "All windows are tall and wide, and there's even a large window in the rear three-quarters portion to eliminate blind spots. A standard rearview camera is nice but unnecessary given the ample window openings. A power bump on the hood makes it tough to figure out where the right side of the car is."}, {"class": "Quality", "score": "5.0", "expert_review": "Inspired interior design and high build quality elevate the Countryman above the usual selection of compact crossovers and even give the luxury brands a run for the money. Molded plastic on the upper door panels, a soft-touch surface on the dash, and cloth on the door make it feel premium."}], "Utility": [{"class": "Utility-overall", "score": 3.0, "expert_review": "While the cargo area is a bit small for the class, the floor sits well below the top of the back seat, so you can load tall items without encroaching on rear visibility. There are limited storage solutions for those in the back because there's no armrest or flip-out tray behind the center console."}, {"class": "Small-item storage", "score": "3.5", "expert_review": "There are large cutouts in all the doors, each split in two sections. Both sections will hold a bottle of water. There's a small tray in front of the shifter and a bin under the armrest for front occupants. There's no fold-down center armrest in the back, which would normally house a tray."}, {"class": "Cargo space", "score": "2.5", "expert_review": "The cargo area is wide and boxy, with a liftover height that's a couple inches lower than a typical crossover. It measures 17.6 cubic feet behind the rear seats and 47.6 cubes with them folded; both figures are small for the class. A nifty LED light in the back helps you find stuff in the dark."}, {"class": "Child safety seat accommodation", "score": "4.5", "expert_review": "There are four LATCH anchors, two on each of the outboard seats. There are easily accessed, located under clearly marked flip-up covers. There's one tether on the back of each portion of the 40/20/40-split rear seats. You'll have to pop the cargo door or remove the cargo cover to access them."}], "Technology": [{"class": "Technology-overall", "score": 4.5, "expert_review": "The newest version of Mini's user interface is attractive but seems to be a bit more cumbersome to use than in previous iterations. The maps, however, are less cluttered than before. Voice controls work well, with natural voice commands. Many advanced safety features are available."}, {"class": "Audio & navigation", "score": "3.5", "expert_review": "The Countryman's central display screen gains touchscreen functionality this year. Because there's so much iconography (at least from the main screen), you're better off using the controller. The menus' horizontal buttons further make the case for the controller. Satellite radio frequently drops."}, {"class": "Smartphone integration", "score": "3.0", "expert_review": "There are two USB ports in the front: one in a bin in front of the shifter and one under the central armrest. There are no USB ports in the back. Android Auto and Apple CarPlay aren't offered, but some apps, such as Spotify and Pandora, are accessible through audio menus."}, {"class": "Driver aids", "score": "4.0", "expert_review": "A rearview camera and rear parking sensors are standard on all models. Our tester was also equipped with the Technology package, adding front sensors and a larger central screen. Park too closely to an object in front and the sensor issues a loud alert even if you're not in gear."}, {"class": "Voice control", "score": "5.0", "expert_review": "The voice controls are excellent. The system recognizes natural speech rather than forcing the user to travel down a path of predetermined phrases. The navigation function can redirect to a similar house number if it can't find yours in the system. Siri Eyes Free is available for iPhone users."}]}, "features": {"Engine Type": "Gas", "Transmission": "8-speed shiftable automatic", "Drive Type": "Front wheel drive", "Cylinders": "Inline 4", "Combined MPG": "27", "Total Seating": "5", "Basic Warranty": "4 yr./ 50000 mi.", "Drive type": "Front wheel drive", "Center limited slip differential": "no", "EPA mileage est. (cty/hwy)": "23/32 mpg", "Range in miles (cty/hwy)": "370.3/515.2 mi.", "Fuel tank capacity": "16.1 gal.", "Fuel type": "Premium unleaded (required)", "Torque": "207 ft-lbs. @ 1250 rpm", "Base engine size": "2.0 l", "Horsepower": "189 hp @ 5000 rpm", "Turning circle": "37.4 ft.", "Valves": "16", "direct injection": "yes", "Base engine type": "Gas", "Valve timing": "Variable", "Cam type": "Double overhead cam (dohc)", "4-wheel ABS": "yes", "Rear door child safety locks": "yes", "cornering lights": "yes", "daytime running lights": "yes", "engine immobilizer": "yes", "front fog/driving lights": "yes", "Rear center 3-point belt": "yes", "child seat anchors": "yes", "dual front side-mounted airbags": "yes", "front and rear head airbags": "yes", "stability control": "yes", "Emergency braking assist": "yes", "Passenger airbag occupant sensing deactivation": "yes", "Rear height adjustable headrests": "yes", "2 front headrests": "yes", "3 rear headrests": "yes", "dusk sensing headlamps": "yes", "LED headlamp": "yes", "tire pressure monitoring": "yes", "traction control": "yes", "Ventilated front disc / solid rear disc brakes": "yes", "John Cooper Works Exterior Package": "yes", "Premium Package": "yes", "John Cooper Works Interior Pack": "yes", "Fully Loaded": "yes", "Cold Weather Package": "yes", "Technology Package": "yes", "Convenience Package": "yes", "MINI Excitement Package": "no", "Sport Package": "no", "auxiliary audio input and USB with external media control": "yes", "USB connection": "yes", "AM/FM  stereo": "yes", "Audio and cruise controls on steering wheel": "yes", "front seatback storage": "yes", "cruise control": "yes", "leather steering wheel": "yes", "keyless ignition": "yes", "Climate control": "yes", "Dual illuminating vanity mirrors": "yes", "front and rear cupholders": "yes", "rear parking sensors": "yes", "front and rear door pockets": "yes", "electric power steering": "yes", "rear view camera": "yes", "tilt and telescopic steering wheel": "yes", "interior air filtration": "yes", "hands-free entry": "yes", "Heated mirrors": "yes", "JCW Leather Steering Wheel": "yes", "MINI Yours Leather Steering Wheel": "yes", "Deletion of Sport Seats": "yes", "Satellite Radio w/1 Year AllAccess Subscription": "yes", "Universal Garage-Door Opener": "yes", "Power Front Seats": "yes", "Headliner in Anthracite": "yes", "Chrome Line Interior": "yes", "Heated Front Seats": "yes", "Harman Kardon Premium Sound System": "yes", "MINI Head-Up Display": "yes", "Sport Seats": "no", "clock": "yes", "external temperature display": "yes", "trip computer": "yes", "tachometer": "yes", "Front head room": "40.5 in.", "6 -way manual driver seat adjustments": "yes", "height adjustable passenger seat": "yes", "height adjustable driver seat": "yes", "sport front seats": "yes", "Front shoulder room": "54.8 in.", "leatherette": "yes", "Front leg room": "40.4 in.", "6 -way manual passenger seat adjustment": "yes", "multi-level heating passenger seat": "no", "multi-level heating driver seat": "no", "bucket front seats": "no", "Rear head room": "38.3 in.", "Rear leg room": "37.6 in.", "Rear shoulder room": "54.0 in.", "folding with pass-thru center armrest": "yes", "rear ventilation ducts": "yes", "reclining rear seats": "yes", "Split-folding rear seatback": "yes", "19\" JCW Course Spoke Wheels": "yes", "Rear Spoiler": "yes", "18\"  Pin Spoke Silver Wheels": "yes", "19\" MINI Yours Masterpiece Wheels": "yes", "18\"  Pin Spoke Black Alloy Wheels": "yes", "Power Tailgate": "yes", "All-Season Tires": "yes", "Auto-Dimming Interior and Exterior Mirrors": "yes", "White Bonnet Stripes": "yes", "19\" Edged Spoke Alloy Wheels": "yes", "18\"  JCW Thrill Spoke Alloy Wheels": "yes", "Offroad Exterior Styling": "yes", "Privacy Glass": "yes", "Black Bonnet Stripes": "yes", "Chrome Line Exterior": "yes", "Active Driving Assistant": "yes", "17\" Channel Spoke Alloy Wheels": "no", "LED Headlights w/Cornering Lights": "no", "LED Fog Lights": "no", "18\"  Pair Spoke Alloy Wheels": "no", "Maximum cargo capacity": "47.6 cu.ft.", "Length": "169.8 in.", "Curb weight": "3508 lbs.", "Cargo capacity, all seats in place": "17.6 cu.ft.", "Ground clearance": "6.5 in.", "Height": "61.3 in.", "EPA interior volume": "114.5 cu.ft.", "Wheel base": "105.1 in.", "Width": "71.7 in.", "Exterior Colors": "MINI Yours Lapisluxury BlueMidnight Black MetallicThunder Grey MetallicMelting Silver MetallicMoonwalk Grey MetallicChili RedBritish Racing Green MetallicChestnutLight WhiteIsland Blue Metallic", "Interior Colors": "Carbon Black Cross Punch, leatherCarbon Black Cord, leather/clothSatellite Grey Lounge, leatherDouble Stripe Carbon Black, premium clothBlack Pearl, leatherette/clothCarbon Black SensaTec, leatheretteMINI Yours Carbon Black Lounge, leatherBritish Oak Chesterfield, leather", "Run flat tires": "yes", "225/50R18 tires": "yes", "18 x 7.5 in. wheels": "yes", "alloy wheels": "yes", "17 x 7.5 in. wheels": "no", "225/55R17 tires": "no", "four-wheel independent suspension": "yes", "Free Maintenance": "3 yr./ 36000 mi.", "Basic": "4 yr./ 50000 mi.", "Drivetrain": "4 yr./ 50000 mi.", "Rust": "12 yr./ unlimited mi.", "Roadside": "4 yr./ unlimited mi.", " ": "See Countryman Inventory"}, "consumers": []}]